tap "gromgit/brewtils"
tap "infisical/get-cli"
tap "peterldowns/tap"
brew "act"
brew "tree"
brew "ansible"
brew "brotli"
brew "atuin"
brew "awscli"
brew "bat"
brew "biome"
brew "bitwarden-cli"
brew "btop"
brew "caddy"
brew "chezmoi"
brew "cloudflared"
brew "cmake"
brew "composer"
brew "coreutils"
brew "deno"
brew "dockutil"
brew "ente-cli"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fileicon"
brew "fish"
brew "fx"
brew "fzf"
brew "fzf-make"
brew "gemini-cli"
brew "gh"
brew "gifsicle"
brew "git"
brew "gnupg"
brew "go"
brew "grep"
brew "grex"
brew "groff"
brew "hostess"
brew "httpie"
brew "hub"
brew "ice"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lf"
brew "localtunnel"
brew "mackup"
brew "mas"
brew "mise"
brew "mkcert"
brew "mongocli"
brew "mongosh"
brew "pydantic"
brew "mycli"
brew "neovim"
brew "noti"
brew "opencode"
brew "peco"
brew "percona-toolkit"
brew "pgcli"
brew "pnpm"
brew "poppler"
brew "psgrep"
brew "python-setuptools"
brew "resvg"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sesh"
brew "sevenzip"
brew "shellcheck"
brew "ssh-copy-id"
brew "sshs"
brew "starship"
brew "subversion"
brew "tailscale"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "trash"
brew "uv"
brew "vim"
brew "wget"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "gromgit/brewtils/taproom"
brew "infisical/get-cli/infisical"
brew "peterldowns/tap/localias"
cask "adguard"
cask "affinity"
cask "alt-tab"
cask "android-file-transfer"
cask "android-platform-tools"
cask "arc"
cask "audacity"
cask "bitwarden"
cask "bloom"
cask "bluesnooze"
cask "calibre"
cask "cleanshot"
cask "coderabbit"
cask "cursor"
cask "daisydisk"
cask "devutils"
cask "ente-auth"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "free-download-manager"
cask "gcloud-cli"
cask "google-chrome"
cask "grammarly-desktop"
cask "grandperspective"
cask "iina"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "jordanbaird-ice@beta"
cask "karabiner-elements"
cask "keycastr"
cask "local"
cask "localcan"
cask "localsend"
cask "losslesscut"
cask "macupdater"
cask "marta"
cask "memory-cleaner"
cask "messenger"
cask "mp4tools"
cask "notion"
cask "numi"
cask "obs"
cask "omnidisksweeper"
cask "onyx"
cask "orbstack"
cask "pearcleaner"
cask "qspace-pro"
cask "raycast"
cask "remnote"
cask "repo-prompt"
cask "shortcat"
cask "shottr"
cask "spotify"
cask "stremio"
cask "sublime-text"
cask "superwhisper"
cask "surfshark"
cask "tableplus"
cask "tailscale-app"
cask "telegram-desktop"
cask "ticktick"
cask "tradingview"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "yaak"
cask "zed"
mas "Battery Monitor", id: 836505650
mas "Bear", id: 1091189122
mas "Deskeen", id: 6746357941
mas "Kindle", id: 302584613
mas "Klack", id: 6446206067
mas "Spokenly", id: 6740315592
mas "TeraCopy", id: 1378806557
mas "The Unarchiver", id: 425424353
mas "Unsplash Wallpapers", id: 1284863847
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "adamwalzer.string-converter"
vscode "adpyke.vscode-sql-formatter"
vscode "aestudio.tailwind-skeleton-generator"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "astro-build.astro-vscode"
vscode "beardedbear.beardedtheme"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "brandonkirbyson.vscode-animations"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "drcika.apc-extension"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "ibm.output-colorizer"
vscode "illixion.vscode-vibrancy-continued"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "johnpapa.vscode-peacock"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mattpocock.ts-error-translator"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "meganrogge.template-string-converter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "nrwl.angular-console"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "ryu1kn.partial-diff"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "steoates.autoimport"
vscode "stripe.markdoc-language-support"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "xdebug.php-debug"
vscode "yinfei.luahelper"
vscode "yzhang.markdown-all-in-one"
vscode "zardoy.fix-all-json"
