tap "gromgit/brewtils"
tap "infisical/get-cli"
tap "peterldowns/tap"
brew "act"
brew "tree"
brew "ansible"
brew "brotli"
brew "atuin"
brew "awscli"
brew "bat"
brew "biome"
brew "bitwarden-cli"
brew "btop"
brew "caddy"
brew "chezmoi"
brew "cloudflared"
brew "cmake"
brew "composer"
brew "coreutils"
brew "deno"
brew "dockutil"
brew "ente-cli"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fileicon"
brew "fish"
brew "fx"
brew "fzf"
brew "fzf-make"
brew "gemini-cli"
brew "gh"
brew "gifsicle"
brew "git"
brew "gnupg"
brew "go"
brew "grep"
brew "grex"
brew "groff"
brew "hostess"
brew "httpie"
brew "hub"
brew "ice"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lf"
brew "localtunnel"
brew "mackup"
brew "mas"
brew "mise"
brew "mkcert"
brew "mongocli"
brew "mongosh"
brew "pydantic"
brew "mycli"
brew "neovim"
brew "noti"
brew "opencode"
brew "peco"
brew "percona-toolkit"
brew "pgcli"
brew "pnpm"
brew "poppler"
brew "psgrep"
brew "python-setuptools"
brew "resvg"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sesh"
brew "sevenzip"
brew "shellcheck"
brew "ssh-copy-id"
brew "sshs"
brew "starship"
brew "subversion"
brew "tailscale"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "topgrade"
brew "trash"
brew "uv"
brew "vim"
brew "wget"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "gromgit/brewtils/taproom"
brew "infisical/get-cli/infisical"
brew "peterldowns/tap/localias"
cask "1password"
cask "adguard"
cask "affinity"
cask "aldente"
cask "alt-tab"
cask "android-file-transfer"
cask "android-platform-tools"
cask "antigravity"
cask "arc"
cask "audacity"
cask "betterzip"
cask "bitwarden"
cask "blip"
cask "bloom"
cask "bluesnooze"
cask "calibre"
cask "cleanshot"
cask "coderabbit"
cask "cursor"
cask "daisydisk"
cask "devutils"
cask "ente-auth"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "forklift"
cask "free-download-manager"
cask "gcloud-cli"
cask "google-chrome"
cask "grandperspective"
cask "hyperwhisper"
cask "iina"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "jordanbaird-ice@beta"
cask "karabiner-elements"
cask "keycastr"
cask "local"
cask "localcan"
cask "localsend"
cask "losslesscut"
cask "macupdater"
cask "marta"
cask "memory-cleaner"
cask "messenger"
cask "mp4tools"
cask "notion"
cask "numi"
cask "obs"
cask "onyx"
cask "orbstack"
cask "pearcleaner"
cask "qspace-pro"
cask "raycast"
cask "remnote"
cask "repo-prompt"
cask "shortcat"
cask "shottr"
cask "spotify"
cask "stremio"
cask "sublime-text"
cask "superwhisper"
cask "surfshark"
cask "tableplus"
cask "tailscale-app"
cask "telegram-desktop"
cask "ticktick"
cask "tradingview"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "yaak"
cask "zed"
mas "Battery Monitor", id: 836505650
mas "Bear", id: 1091189122
mas "Deskeen", id: 6746357941
mas "Kindle", id: 302584613
mas "Klack", id: 6446206067
mas "Pastel", id: 413897608
mas "TeraCopy", id: 1378806557
mas "The Unarchiver", id: 425424353
mas "Unsplash Wallpapers", id: 1284863847
mas "Xcode", id: 497799835
